Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2064dab176.h
extern volatile __TRISKbits_t TRISKbits __asm__ ("TRISK") __attribute__((section("sfrs"), address(0xBF860910)));
extern volatile uint32_t        TRISKCLR __attribute__((section("sfrs"),address(0xBF860914)));
extern volatile uint32_t        TRISKSET __attribute__((section("sfrs"),address(0xBF860918)));
extern volatile uint32_t        TRISKINV __attribute__((section("sfrs"),address(0xBF86091C)));
#define PORTK PORTK
extern volatile uint32_t   PORTK __attribute__((section("sfrs"), address(0xBF860920)));
typedef union {
  struct {
    uint32_t RK0:1;
    uint32_t RK1:1;
    uint32_t RK2:1;
    uint32_t RK3:1;
    uint32_t RK4:1;
    uint32_t RK5:1;
    uint32_t RK6:1;
    uint32_t RK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTKbits_t;
extern volatile __PORTKbits_t PORTKbits __asm__ ("PORTK") __attribute__((section("sfrs"), address(0xBF860920)));
extern volatile uint32_t        PORTKCLR __attribute__((section("sfrs"),address(0xBF860924)));
extern volatile uint32_t        PORTKSET __attribute__((section("sfrs"),address(0xBF860928)));
extern volatile uint32_t        PORTKINV __attribute__((section("sfrs"),address(0xBF86092C)));
#define LATK LATK
extern volatile uint32_t   LATK __attribute__((section("sfrs"), address(0xBF860930)));
typedef union {
  struct {
    uint32_t LATK0:1;
    uint32_t LATK1:1;
    uint32_t LATK2:1;
    uint32_t LATK3:1;
    uint32_t LATK4:1;
    uint32_t LATK5:1;
    uint32_t LATK6:1;
    uint32_t LATK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATKbits_t;
extern volatile __LATKbits_t LATKbits __asm__ ("LATK") __attribute__((section("sfrs"), address(0xBF860930)));
extern volatile uint32_t        LATKCLR __attribute__((section("sfrs"),address(0xBF860934)));
extern volatile uint32_t        LATKSET __attribute__((section("sfrs"),address(0xBF860938)));
extern volatile uint32_t        LATKINV __attribute__((section("sfrs"),address(0xBF86093C)));
#define ODCK ODCK
extern volatile uint32_t   ODCK __attribute__((section("sfrs"), address(0xBF860940)));
typedef union {
  struct {
    uint32_t ODCK0:1;
    uint32_t ODCK1:1;
    uint32_t ODCK2:1;
    uint32_t ODCK3:1;
    uint32_t ODCK4:1;
    uint32_t ODCK5:1;
    uint32_t ODCK6:1;
    uint32_t ODCK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCKbits_t;
extern volatile __ODCKbits_t ODCKbits __asm__ ("ODCK") __attribute__((section("sfrs"), address(0xBF860940)));
extern volatile uint32_t        ODCKCLR __attribute__((section("sfrs"),address(0xBF860944)));
extern volatile uint32_t        ODCKSET __attribute__((section("sfrs"),address(0xBF860948)));
extern volatile uint32_t        ODCKINV __attribute__((section("sfrs"),address(0xBF86094C)));
#define CNPUK CNPUK
extern volatile uint32_t   CNPUK __attribute__((section("sfrs"), address(0xBF860950)));
typedef union {
  struct {
    uint32_t CNPUK0:1;
    uint32_t CNPUK1:1;
    uint32_t CNPUK2:1;
    uint32_t CNPUK3:1;
    uint32_t CNPUK4:1;
    uint32_t CNPUK5:1;
    uint32_t CNPUK6:1;
    uint32_t CNPUK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUKbits_t;
extern volatile __CNPUKbits_t CNPUKbits __asm__ ("CNPUK") __attribute__((section("sfrs"), address(0xBF860950)));
extern volatile uint32_t        CNPUKCLR __attribute__((section("sfrs"),address(0xBF860954)));
extern volatile uint32_t        CNPUKSET __attribute__((section("sfrs"),address(0xBF860958)));
extern volatile uint32_t        CNPUKINV __attribute__((section("sfrs"),address(0xBF86095C)));
#define CNPDK CNPDK
extern volatile uint32_t   CNPDK __attribute__((section("sfrs"), address(0xBF860960)));
typedef union {
  struct {
    uint32_t CNPDK0:1;
    uint32_t CNPDK1:1;
    uint32_t CNPDK2:1;
    uint32_t CNPDK3:1;
    uint32_t CNPDK4:1;
    uint32_t CNPDK5:1;
    uint32_t CNPDK6:1;
    uint32_t CNPDK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDKbits_t;
extern volatile __CNPDKbits_t CNPDKbits __asm__ ("CNPDK") __attribute__((section("sfrs"), address(0xBF860960)));
extern volatile uint32_t        CNPDKCLR __attribute__((section("sfrs"),address(0xBF860964)));
extern volatile uint32_t        CNPDKSET __attribute__((section("sfrs"),address(0xBF860968)));
extern volatile uint32_t        CNPDKINV __attribute__((section("sfrs"),address(0xBF86096C)));
#define CNCONK CNCONK
extern volatile uint32_t   CNCONK __attribute__((section("sfrs"), address(0xBF860970)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONKbits_t;
extern volatile __CNCONKbits_t CNCONKbits __asm__ ("CNCONK") __attribute__((section("sfrs"), address(0xBF860970)));
extern volatile uint32_t        CNCONKCLR __attribute__((section("sfrs"),address(0xBF860974)));
extern volatile uint32_t        CNCONKSET __attribute__((section("sfrs"),address(0xBF860978)));
extern volatile uint32_t        CNCONKINV __attribute__((section("sfrs"),address(0xBF86097C)));
#define CNENK CNENK
extern volatile uint32_t   CNENK __attribute__((section("sfrs"), address(0xBF860980)));
typedef union {
  struct {
    uint32_t CNIEK0:1;
    uint32_t CNIEK1:1;
    uint32_t CNIEK2:1;
    uint32_t CNIEK3:1;
    uint32_t CNIEK4:1;
    uint32_t CNIEK5:1;
    uint32_t CNIEK6:1;
    uint32_t CNIEK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENKbits_t;
extern volatile __CNENKbits_t CNENKbits __asm__ ("CNENK") __attribute__((section("sfrs"), address(0xBF860980)));
extern volatile uint32_t        CNENKCLR __attribute__((section("sfrs"),address(0xBF860984)));
extern volatile uint32_t        CNENKSET __attribute__((section("sfrs"),address(0xBF860988)));
extern volatile uint32_t        CNENKINV __attribute__((section("sfrs"),address(0xBF86098C)));
#define CNSTATK CNSTATK
extern volatile uint32_t   CNSTATK __attribute__((section("sfrs"), address(0xBF860990)));
typedef union {
  struct {
    uint32_t CNSTATK0:1;
    uint32_t CNSTATK1:1;
    uint32_t CNSTATK2:1;
    uint32_t CNSTATK3:1;
    uint32_t CNSTATK4:1;
    uint32_t CNSTATK5:1;
    uint32_t CNSTATK6:1;
    uint32_t CNSTATK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATKbits_t;
extern volatile __CNSTATKbits_t CNSTATKbits __asm__ ("CNSTATK") __attribute__((section("sfrs"), address(0xBF860990)));
extern volatile uint32_t        CNSTATKCLR __attribute__((section("sfrs"),address(0xBF860994)));
extern volatile uint32_t        CNSTATKSET __attribute__((section("sfrs"),address(0xBF860998)));
extern volatile uint32_t        CNSTATKINV __attribute__((section("sfrs"),address(0xBF86099C)));
#define CNNEK CNNEK
extern volatile uint32_t   CNNEK __attribute__((section("sfrs"), address(0xBF8609A0)));
typedef struct {
  uint32_t CNNEK0:1;
  uint32_t CNNEK1:1;
  uint32_t CNNEK2:1;
  uint32_t CNNEK3:1;
  uint32_t CNNEK4:1;
  uint32_t CNNEK5:1;
  uint32_t CNNEK6:1;
  uint32_t CNNEK7:1;
} __CNNEKbits_t;
